# language: ru
@login
Функция: Футер
  Сценарий: Проверка переходов в футере
    Пусть Я нахожусь на главной странице
    Когда Я скролю до "О Компании" на "Футер"
    Когда Я нажимаю "О Компании" на "Футер"
    Тогда Я вижу "Тайтл" на "Футер"
    Когда Я нажимаю назад
    Когда Я нажимаю "Контакты" на "Футер"
    Тогда Я вижу "Тайтл" на "Футер"
    Когда Я нажимаю назад
    Когда Я нажимаю "Вакансии" на "Футер"
    Тогда Я вижу "Тайтл" на "Футер"
    Когда Я нажимаю назад
    Когда Я нажимаю "Манифест" на "Футер"
    Тогда Я вижу "Тайтл" на "Футер"
    Когда Я нажимаю назад
    Когда Я нажимаю "Пользовательское Соглашение" на "Футер"
    Тогда Я вижу "Тайтл" на "Футер"
    Когда Я нажимаю назад
    Когда Я нажимаю "Публичные договоры" на "Футер"
    Тогда Я вижу "Тайтл" на "Футер"
    Когда Я нажимаю назад
    Когда Я нажимаю "Политика Конфиденциальности" на "Футер"
    Тогда Я вижу "Тайтл" на "Футер"
    Когда Я нажимаю назад
    Когда Я нажимаю "Правила Возврата" на "Футер"
    Тогда Я вижу "Тайтл" на "Футер"



